Gregification/BeeMS/VT_MSPM0G3507_A/src/Core/system.cpp
        case DL_I2C_IIDX_CONTROLLER_TXFIFO_TRIGGER:
            // fill TX fifo
            if(trxBuffer.isInUse()){
                trxBuffer.nxt_index +=  DL_I2C_fillControllerTXFIFO(
                        reg,
                        (uint8_t *)trxBuffer.data,
                        trxBuffer.data_length - trxBuffer.nxt_index
                    );
            }
            break;

        case DL_I2C_IIDX_CONTROLLER_ARBITRATION_LOST:
        case DL_I2C_IIDX_CONTROLLER_NACK:
            if(trxBuffer.isInUse())
                xTaskNotifyGiveIndexed(trxBuffer.host_task, TASK_NOTIFICATION_ARRAY_INDEX_FOR_SYSTEM_I2C_IRQ);
            break;

        case DL_I2C_IIDX_CONTROLLER_RXFIFO_FULL:
        case DL_I2C_IIDX_CONTROLLER_TXFIFO_EMPTY:
        case DL_I2C_IIDX_CONTROLLER_START:
        case DL_I2C_IIDX_CONTROLLER_STOP:
        case DL_I2C_IIDX_CONTROLLER_EVENT1_DMA_DONE:
        case DL_I2C_IIDX_CONTROLLER_EVENT2_DMA_DONE:
        default:
            break;

    };
    taskEXIT_CRITICAL_FROM_ISR(isr_status);
}

bool System::I2C::I2C::tx_blocking(uint8_t addr, void * data, uint8_t size, TickType_t timeout) {

    DL_I2C_flushControllerTXFIFO(reg);

    size -= DL_I2C_fillControllerTXFIFO(reg, (uint8_t *)data, size);

    while (!(DL_I2C_getControllerStatus(reg) & DL_I2C_CONTROLLER_STATUS_IDLE))
        {}

    DL_I2C_startControllerTransfer(
            reg,
            addr,
            DL_I2C_CONTROLLER_DIRECTION::DL_I2C_CONTROLLER_DIRECTION_TX,
            size
        );

    while(size > 0){
        size -= DL_I2C_fillControllerTXFIFO(reg, (uint8_t *)data, size);

        if(DL_I2C_getControllerStatus(reg) & (
                DL_I2C_CONTROLLER_STATUS_IDLE
                | DL_I2C_CONTROLLER_STATUS_ERROR
            ))
            break;
    }

    while (DL_I2C_getControllerStatus(reg) &
               DL_I2C_CONTROLLER_STATUS_BUSY_BUS)
            ;

    // delay some
    delay_cycles(80 * 60);

    return true;
}

bool System::I2C::I2C::rx_blocking(uint8_t addr, void * data, uint8_t size, TickType_t timeout) {
    while (!(DL_I2C_getControllerStatus(reg) & DL_I2C_CONTROLLER_STATUS_IDLE))
            {}

    DL_I2C_flushControllerTXFIFO(reg);

    DL_I2C_startControllerTransfer(
                reg,
                addr,
                DL_I2C_CONTROLLER_DIRECTION::DL_I2C_CONTROLLER_DIRECTION_RX,
                size
            );
    for(uint8_t i = 0; i < size; i++){
        while(DL_I2C_isControllerRXFIFOEmpty(reg)){
            if(DL_I2C_getControllerStatus(reg) & (
                    DL_I2C_CONTROLLER_STATUS_IDLE
                    | DL_I2C_CONTROLLER_STATUS_ERROR
                ))
                break;
        }
        ((uint8_t *)data)[i] = DL_I2C_receiveControllerData(reg);
    }

    // delay some
    delay_cycles(80 * 60);
    return true;
}


//uint8_t System::I2C::I2C::basic_tx_blocking(uint8_t addr, void const * data, uint8_t size){
//    uint8_t const * arr = (uint8_t const *)data;
//
//    DL_I2C_flushControllerTXFIFO(reg);
//
//    size -= DL_I2C_fillControllerTXFIFO(reg, arr, size);
//
//    while (!(DL_I2C_getControllerStatus(reg) & DL_I2C_CONTROLLER_STATUS_IDLE))
//        {}
//
//    DL_I2C_startControllerTransfer(
//            reg,
//            addr,
//            DL_I2C_CONTROLLER_DIRECTION::DL_I2C_CONTROLLER_DIRECTION_TX,
//            size
//        );
//
//    while(size > 0){
//        size -= DL_I2C_fillControllerTXFIFO(reg, arr, size);
//
//        if(DL_I2C_getControllerStatus(reg) & (
//                DL_I2C_CONTROLLER_STATUS_IDLE
//                | DL_I2C_CONTROLLER_STATUS_ERROR
//            ))
//            break;
//    }
//
//    while (DL_I2C_getControllerStatus(reg) &
//               DL_I2C_CONTROLLER_STATUS_BUSY_BUS)
//            ;
//
//    // delay some
//    delay_cycles(80 * 60);
//
//    return size;
//}
//
//uint8_t System::I2C::I2C::basic_rx_blocking(uint8_t addr, void * data, uint8_t size){
//
//
//    while (!(DL_I2C_getControllerStatus(reg) & DL_I2C_CONTROLLER_STATUS_IDLE))
//            {}
//
//    DL_I2C_flushControllerTXFIFO(reg);
//
//    DL_I2C_startControllerTransfer(
//                reg,
//                addr,
//                DL_I2C_CONTROLLER_DIRECTION::DL_I2C_CONTROLLER_DIRECTION_RX,
//                size
//            );
//    for(uint8_t i = 0; i < size; i++){
//        while(DL_I2C_isControllerRXFIFOEmpty(reg)){
//            if(DL_I2C_getControllerStatus(reg) & (
//                    DL_I2C_CONTROLLER_STATUS_IDLE
//                    | DL_I2C_CONTROLLER_STATUS_ERROR
//                ))
//                break;
//        }
//        ((uint8_t *)data)[i] = DL_I2C_receiveControllerData(reg);
//    }
//
//    // delay some
//    delay_cycles(80 * 60);
//
//    return size;
//}

/*--- Peripheral IRQ assignment --------------------------------------------------------*/
/* most peripherals don't need a IRQ
 */

#ifdef PROJECT_ENABLE_I2C0
    extern "C" void I2C0_IRQHandler(void){ System::i2c0._irq(); }
#endif
#ifdef PROJECT_ENABLE_I2C1
    extern "C" void I2C1_IRQHandler(void){ System::i2c1._irq(); }
#endif

